<%@ page contentType="text/html;charset=utf-8" %>

<!DOCTYPE HTML>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>text</title>
    <link rel="stylesheet" href="css/style.css">
    <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css" integrity="sha384-BVYiiSIFeK1dGmJRAkycuHAHRg32OmUcww7on3RYdg4Va+PmSTsz/K68vbdEjh4u" crossorigin="anonymous">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>

<div class="container">
    <div class="page-header"><div>Много текста</div></div>

    <div class="demoBlock">
        Часть первая
        Дайвер
        00

        Хочется закрыть глаза. Это нормально. Цветной калейдоскоп, блёстки, искрящийся звёздный вихрь — красиво, но я знаю, что стоит за этой красотой.

        Глубина. Её называют «дип», но мне кажется, что по-русски слово звучит правильнее. Заменяет красивый ярлычок предупреждением. «Глубина!» Здесь водятся акулы и спруты. Здесь тихо — и давит, давит, давит бесконечное пространство, которого на самом деле нет.

        В общем-то, она добрая, глубина. По-своему, конечно. Она принимает любого. Чтобы нырнуть, нужно немного сил. Чтобы достичь дна и вернуться — куда больше. В первую очередь надо помнить — глубина мертва без нас. Надо и верить в неё, и не верить.

        Иначе настанет день, когда не удастся вынырнуть.
        01

        Первые движения — самые трудные. Комната небольшая, стол стоит посередине, жгуты проводов от компьютера тянутся к УПС — установке бесперебойного питания, в углу, и дальше — к розетке. Тонкий провод уходит к телефонной линии. У стены, под роскошным ковром, тахта, у открытой двери на балкон — маленький холодильник. Самое необходимое. Пять минут назад я проверил, что лежит в холодильнике, так что голод в ближайшие сутки мне не грозит.

        Я поворачиваю голову, налево, направо — на мгновение в глазах темнеет, но это лишь секунда. Ничего. Бывает.

        — Всё в порядке, Лёня?

        Динамики отрегулированы на максимум, я морщусь, отвечаю:

        — Да. Тише звук.

        — Звук — тише, — соглашается «Виндоус-Хоум», — тише, тише…

        — Хватит, Вика, — останавливаю я. Хорошая программа. Послушная, понятливая и доброжелательная. Не без самомнения, как вся продукция «Микрософта», но с этим приходится мириться.

        — Удачи, — говорит программа. — Когда тебя ждать?

        Я смотрю на экран — там, в ореоле оранжевых искр, плывёт женское лицо. Молодое, симпатичное, но в общем — ничего особенного. Устал я от красоты.

        — Не знаю.

        — Я бы хотела иметь десять минут на самоконтроль.

        — Хорошо. Но не более. Через десять минут мне понадобятся все ресурсы.

        Лицо на экране морщится — программа вычленяет ключевые слова.

        — Только десять минут, — покорно говорит «Виндоус-Хоум». — Но я вновь обращаю твоё внимание, что уровень поставленных задач не всегда соответствует объёму моей оперативной памяти. Желательно расширение до…

        — Утихни, — я встаю. «Утихни» — это безусловный приказ, после него программа спорить не смеет. Шаг влево, шаг вправо… Ха-ха. Нет, это не попытка к бегству, это скорее добровольное заточение. Я дохожу до холодильника, открываю дверцу, достаю банку «спрайта», открываю. Напиток холодит горло. Это почти ритуал — глубина всегда сушит слизистую. С банкой в руке я выхожу на балкон, в тёплый летний вечер.

        В Диптауне почти всегда вечер. Улицы залиты светом реклам, тихо рокочут несущиеся машины. И идут, идут сплошным потоком люди. Двадцать пять миллионов постоянного населения — самый крупный мегаполис мира. С высоты одиннадцатого этажа лиц не разглядеть. Я допиваю «спрайт», кидаю банку вниз, и возвращаюсь в комнату.

        — Неэтично… — бормочет компьютер. Не реагируя, я выхожу в прихожую, обуваюсь, открываю дверь. Подъезд пустой и светлый, очень-очень чистый. Пока я вожусь с замком, в полуоткрытую дверь пытается влететь крошечный жучок. Ага. Ламеры развлекаются. Я с иронией наблюдаю за настырным насекомым — из квартиры дует ровный поток воздуха, вынося его обратно. Наконец дверь закрыта, жучок в последнем усилии бьётся в дверь, короткая вспышка — и насекомое падает на пол.

        — Подать жалобу владельцу дома? — спрашивает «Виндоус-Хоум». Теперь голос идёт из серебряных заколок на лацканах моей рубашки.

        — Подавай, — соглашаюсь я. Всё забываю объяснить программе, что владельцем дома являюсь я сам.

        Лифт ждёт меня на этаже. Обычно я спускаюсь по лестнице… заглядываю по пути в чужие квартиры. Там ведь всё равно никто не живёт… но сейчас я спешу. Лифт опускается — очень быстро. Выхожу на тротуар, оглядываюсь — может быть увижу любителя насекомых? Но никого подозрительного нет, все спешат по делам. Жучок явно залётный, серийной работы. Их травят на улицах, бьют в квартирах, но они не переводятся.

        Я и сам когда-то развлекался подобной ерундой. Очень-очень редко жучкам удавалось принести интересную информацию.

        — Лёня, на имя компании «Поляна» поступила жалоба от квартиросъёмщика номер один.

        — Игнорируй, — бурчу я, наблюдая за идущим по тротуару мужчиной. Да, это нечто! Гибрид Арнольда Шварцнеггера в молодые годы и Клинта Иствуда в пожилые. Очень, очень смешно. Мужчина ловит мой насмешливый взгляд и ускоряет шаги.

        Я поднимаю руку, и через мгновение у тротуара притормаживает жёлтый лимузин.

        — Лёня, твоя жалоба компании «Поляна» проигнорирована!

        — Ладно. Ничего.

        Это может продолжаться бесконечно долго, а мне сейчас не до игр… Я сажусь в машину, водитель — улыбчивый парень с безупречной причёской и в накрахмаленной рубашке, поворачивается ко мне. Предпочитаю таких таксистов, вышколенных и немногословных.

        — Компания «Дип-проводник» рада приветствовать вас!

        Имени он не называет — программа остановила такси анонимно.

        — Как будете оплачивать счёт?

        — Вот так, — говорю я, доставая из кармана револьвер. Сильно бью парня по виску. Он пытается защититься, но не успевает. Я смотрю на его побледневшее лицо, встряхиваю за шиворот, приказываю:

        — Квартал «Аль-Кабар».

        — Данного адреса не существует, — говорит водитель. Он «оглушён» и покорён.

        — «Аль-Кабар». Восемь-семь-семь-три-восемь, — простенький код открывает доступ к служебным адресам «Дип-проводника». Я мог бы и не бить водителя, но тогда в файлах компании осталась бы информация о поездке.

        — Заказ принят, — водитель улыбается, он вновь весел и услужлив. Машина трогается. Я смотрю в окно — мелькают жилые кварталы, набитые небоскрёбами со всякой мелкой шушерой Диптауна, огромные, роскошные офисы компаний. Вон длинные серые корпуса «ИБМ», пышные дворцы «Микрософта», ажурные башни «Америка Он Лайн», более скромные офисы прочих компьютерных законодателей.
    </div>

    <div class="demoBlock">
        Конечно, полно и офисов фирм по продаже мебели, жратвы, недвижимости, туристических агентств, транспортных компаний, клиник… Мало-мальски жизнеспособная компания стремится открыть в Диптауне своё представительство.

        «Дип-проводник» процветает именно на этом изобилии. Путешествовать по городу пешком — долгое развлечение. Мы мчимся по автострадам, тормозим на перекрёстках, сворачиваем в туннели и пересекаем развязки. Я жду. Можно было бы приказать водителю ехать кратчайшим путём — но тогда он вынужден был бы связаться с диспетчерской. И я оставил бы след…

        Город обрывается внезапно — словно стену дворцов и небоскрёбов отсекают исполинским ножом. Кольцевая дорога, за ней — лес. Густой, дремучий… отделяющий от суеты тех, кто не хочет себя афишировать.

        — Притормози, — говорю я, когда мы минуем манговые заросли и проезжаем мимо вполне среднерусской чащобы. — У следующей тропинки.

        — До квартала «Аль-Кабар» ещё далеко, — говорит водитель.

        — Останови.

        Машина останавливается. Я открываю дверь, отхожу от лимузина на шаг. Водитель покорно ждёт. И я тоже — просвета на дороге. Зачем нам свидетели? Вот, наконец-то…

        Я целюсь в машину, стреляю. Револьвер бьёт негромко, отдача слабая, но машина мгновенно вспыхивает. Водитель сидит, глядя перед собой. Несколько секунд — и у «Дип-проводника» становится одним такси меньше.

        Хорошо. Пусть всё выглядит, как развлечение пьяной шпаны. Я иду в лес.

        — Неэтично… — бормочет из булавок «Виндоус-Хоум».

        — Ты оптимизировалась?

        — Да.

        — Всё, теперь мне нужна помощь. Ищи тайник, код «Иван».

        — Светящееся дерево, — сообщает программа.

        Я озираюсь. Ага. Вот он, огромный дуб, мерцающий колдовским синим светом. Мерцающий лишь для меня. Я подхожу к нему, засовываю руку в дупло, вынимаю большой тяжёлый свёрток. Переодеваюсь в полотняную белую рубаху и штаны, подпоясываюсь узорчатым поясом. Короткий меч в ножнах, несколько вещичек в карманах. Тайник я создал пару дней назад, незаконно использовав один из компьютеров транспортного управления закавказской железной дороги. Там слабые программисты, они долго не заметят этого маленького вторжения.

        — Где ручей? — спрашиваю я.

        — Справа.

        Я склоняюсь над бегущей водой, смотрю в отражение. Несколько раз бью по нему ладонью, потом начинаю водить пальцем, стирая свой облик. Вместо меня из дрожащего зеркала прорисовывается русоволосый статный крепыш. Лицо добродушно и незатейливо до отвращения.

        — Спасибо, — говорю я программе, выпрямляюсь. Стою, любуюсь лесом. Чёрт возьми, как давно я не выбирался из городского смрада…

        — Не меня ли ты ждёшь, добрый молодец? — спрашивают из-за спины. Оборачиваюсь — из густых кустов выходит огромный, по грудь мне ростом, волк.

        — Может и тебя, — говорю я, любуясь волком. Чёрт возьми, великолепен! Он действительно серый, и не просто серый — именно чернистого с проседью волчьего цвета. Кое-где шерсть свалялась, к передней правой лапе пристал репейник.

        — А не съесть ли мне тебя, добрый молодец? — спрашивает волк и скалится. Клыки жёлтые, как зубы курильщика, один обломлен под корень. Матёрый, опытный волчище.

        — Что ты попусту похваляешься, на богатырский меч нарываешься? — импровизирую я. — Лучше службу сослужи!

        Волк улыбается, садится.

        — А чем расплатишься, богатырь?

        — По три тысячи зелёных, — сообщаю я. Волк удовлетворённо кивает, трёт лапой морду. Спрашивает:

        — «Аль-Кабар»?

        — Угадал.

        — Миссия?

        — Кража.

        — А кто заказчик?

        Я пожимаю плечами. Ответ столь же риторический, как и вопрос. Заказчики огласки не любят.

        — Попробуем, — решает волк. — Ты готов?

        — Вполне.

        — Садись.

        Я забираюсь на спину волка, и тот неторопливой рысцой бежит по лесу. Я инстинктивно уворачиваюсь от веток, волк тонко хихикает. Ладно, пусть веселится.

        Через пару минут мы выскакиваем из леса. Под ногами — жёлтый песок. Жарко, очень жарко, порывы ветра заставляют щуриться. Впереди — пропасть метров в сто шириной, за ней — восточный город. Минареты, купола, всё в оранжево-жёлто-зелёных тонах. Довольно красиво. Невдалеке через пропасть переброшен… хм… ну, назовём это мостом. Тонкая как струна нить. Один её конец кончается на стене, опоясывающей город, другой держит в руке безобразная каменная статуя метров десяти вышиной. Морда у статуи отвратительная.

        — Ещё та будет работка, — замечает волк. — Ты не продешевил, Иван-Царевич?

        — А бог его знает… — изучая статую говорю я. — О мосте меня предупредили…

        — Что воровать-то?

        — Наливные яблочки…

        — А, вот к чему такой маскарад… — волк снова хихикает. — А что в яблочках?

        — Не знаю, — я спрыгиваю со спины волка, стою, держа руку на шерсти.

        — Слушай, я на секунду, лимонада попью…

        — Валяй, — озираясь говорит волк.

        Я прикрываю глаза.

        Глубина-глубина, я не твой… Отпусти меня, глубина…

        Я дёрнулся, встал. Перед глазами — крошечные экранчики, на них — пустыня, пропасть, статуя, город вдали. Очень неплохо нарисовано. У «Аль-Кабара» хорошие дизайнеры.

        Виртуальный шлем тяжёлый, это самая «навороченная» модель из серийно выпускаемых «Сони». С прекрасными цветными экранами, великолепными динамиками и встроенным микрофоном, с кондиционером, обдувающим лицо воздухом нужной температуры. Сейчас это жар пустыни… Я снял шлем, положил на стол, рядом с клавиатурой компьютера. На мониторе появилось знакомое женское лицо, из динамиков донеслось:

        — Лёня, ты прерываешь погружение?

        — Нет, жди.

        В реальном мире моя комнатка такая же, как и в виртуальном пространстве. Только за окном не летний вечер Диптауна — дождливая питерская осень. Моросит мелкий дождик, сигналит вдали машина. Я открыл холодильник, взял банку «спрайта». Попью по настоящему… Не удержавшись, выглянул с балкона. Пустой банки, которую в виртуальном пространстве я выкинул на улицу, там конечно же нет. Что ж, устраним различия.

        Волосы были потные, я вытер их валящейся на стуле рубашкой, сел за компьютер, проверил кабель, идущий от виртуального костюма на дип-плату компьютера. Костюм работал, слегка притормаживая движения, словно я шагал по песку. Левую ногу подволакивало чуть сильнее — опять сбоит программа. Ладно, потом откалибруем.
    </div>
</div>
</body>
</html>